app/views/layouts/dashboard/_dashboard_stats.html.erb

SELECT "performances".* FROM "performances" WHERE "performances"."user_id" = 6 ORDER BY "performances"."id" DESC LIMIT 1
---
     <div class="chart4" data-percent="100">
       <%= @user.performance.last.score %>