app/controllers/admin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 6 LIMIT 1
---
  def get_all_users
    @users = User.all