app/controllers/schedule_controller.rb

  def create
    message = false

      if params[:schedule][:event_type] == "pto"
        sched = Schedule.new(schedule_params)
        sched.date_begin, sched.date_end = format_schedule_date(params[:date_range1])
        sched.user_id = current_user.id
        a = sched.date_end
        if sched.save
---
INSERT INTO "schedules" ("created_at", "date_begin", "date_end", "event_desc", "event_name", "event_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)