app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'joe@schmoe.com' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."user_id" = 6 LIMIT 1
---
  def create
      path = params[:url].present? ? params[:url] : home_dashboard_index_path
      begin
        # Normalize the email address, why not
        user = User.authenticate(params[:email].to_s.downcase, params[:password])
       # @url = params[:url]
      rescue Exception => e
      end

      if user
        if params[:remember_me]
        cookies.permanent[:auth_token] = user.auth_token if User.where(:user_id => user.user_id).exists?