app/controllers/work_info_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 6 LIMIT 1
---
  def index
    @user = User.find_by_user_id(params[:user_id])